In [2]:
!pip install pandas

Requirement already satisfied: pandas in d:\krish_naik\python\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in d:\krish_naik\python\venv\lib\site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\krish_naik\python\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\krish_naik\python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\krish_naik\python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\krish_naik\python\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

In [4]:
## Series --> It is one dimensional array like an object that hold any datatype.

data = [1,2,3,4,5]

series = pd.Series(data)
print("Series is :\n",series)

Series is :
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
### Create A Series for Dictionary

data = { 'a':1,'b':2,'c':3,'d':4}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
### Create a Dataframe by Dictionary

data ={
    'Name':['Andy','Marnus','Pluto'],
    'City': ['New York','Southampton','Budapest'],
    'Age':[23,45,56]
}

df =pd.DataFrame(data)
df
#print(type(df))

     Name         City  Age
0    Andy     New York   23
1  Marnus  Southampton   45
2   Pluto     Budapest   56

In [10]:
### Create a Dataframe by using dictionary

data =[
    ['Alice',34,'Paris'],['Mark',28,'Edinburg'],['Nans',24,'London']
]

df = pd.DataFrame(data,columns=['Name','Age','City'])
df

    Name  Age      City
0  Alice   34     Paris
1   Mark   28  Edinburg
2   Nans   24    London

In [13]:
## Read file from different sources

df= pd.read_csv("sales_data (1).csv")
df

,Order ID,Date,Customer Name,Product,Category,Quantity,Unit Price,Total Sales
0,1001,2023-01-01,Alice,Laptop,Electronics,1,1200,1200
1,1002,2023-01-03,Bob,Smartphone,Electronics,2,800,1600
2,1003,2023-01-05,Charlie,Tablet,Electronics,1,300,300
3,1004,2023-01-07,David,Monitor,Electronics,2,200,400
4,1005,2023-01-10,Eva,Printer,Electronics,1,150,150

In [3]:
### Accessing values from the dataset in Pandas
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 70000]
}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [5]:
### Accessing columens 

df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [7]:
df[['Name','Salary']]

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000

In [12]:
df.loc[0]
#df.iloc[0]

Name      Alice
Age          25
Salary    50000
Name: 0, dtype: object

In [16]:
### Accessing specific elements from dataset

print(df.at[1,'Age'])

30

In [21]:
### Accessing specific elements by using iat

print(df.iat[2,1])

35

In [28]:
### Add a column in Dataframe

df['City']=['Florida','New York','Texas']
df

      Name  Age  Salary      City
0    Alice   25   50000   Florida
1      Bob   30   60000  New York
2  Charlie   35   70000     Texas

In [29]:
### Remove Column in Dataframe

df.drop('City',axis=1,inplace=True)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [27]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [30]:
df.describe()

        Age   Salary
count   3.0      3.0
mean   30.0  60000.0
std     5.0  10000.0
min    25.0  50000.0
25%    27.5  55000.0
50%    30.0  60000.0
75%    32.5  65000.0
max    35.0  70000.0